In [1]:
import pandas as pd
import numpy as np

In [2]:
data  = pd.read_csv('/Users/onyekachukwuojumah/Desktop/projects/HDFC-COMMON-CLEAN-V1.csv')
data.head(10)

  TRANSACTION DATE,PARTICULARS,WITHDRAWAL AMT,DEPOSIT AMT,BALANCE AMT
0  1/1/2019,POS 541919XXXXXX4335 ASTER MEDICITY P...
1  1/1/2019,POS 541919XXXXXX4335 WESTSIDE POS DEB...
2  1/1/2019,POS 541919XXXXXX4335 EASY DAY POS DEB...
3  2/1/2019,20190102032039502112/PAYTMWALLETLOADI...
4  2/1/2019,50100034192891-TPT-RENT ,11838,,41690...
5  2/1/2019,PHDF7063992589/BILLDKACTTV ,1249.62,,...
6  3/1/2019,POS 541919XXXXXX4335 ASHWIN PHARMA PO...
7  3/1/2019,50400124720680- RD INSTALLMENT-JAN 20...
8  3/1/2019,UPI-50100121158115-SHAMIM.MOKLES@OKHD...
9  4/1/2019,POS 541919XXXXXX4335 ITUNES.COM/BILLP...

In [3]:

df = data['TRANSACTION DATE,PARTICULARS,WITHDRAWAL AMT,DEPOSIT AMT,BALANCE AMT'].str.split(',', expand=True)

In [4]:
df.head()

,0,1,2,3,4
0,1/1/2019,POS 541919XXXXXX4335 ASTER MEDICITY POS DEBIT,700,,438245.77
1,1/1/2019,POS 541919XXXXXX4335 WESTSIDE POS DEBIT,7291,,430954.77
2,1/1/2019,POS 541919XXXXXX4335 EASY DAY POS DEBIT,208,,430746.77
3,2/1/2019,20190102032039502112/PAYTMWALLETLOADING,2000,,428746.77
4,2/1/2019,50100034192891-TPT-RENT,11838,,416908.77

In [5]:
df['TRANSACTION DATE'] = df[0]
df['PARTICULARS'] = df[1]
df['WITHDRAWAL AMT'] = df[2]
df['DEPOSIT AMT'] = df[3]
df['BALANCE AMT'] = df[4]

In [6]:
df = df.drop([0,1,2,3,4], axis=1)

In [7]:
df.head(100)

,TRANSACTION DATE,PARTICULARS,WITHDRAWAL AMT,DEPOSIT AMT,BALANCE AMT
0,1/1/2019,POS 541919XXXXXX4335 ASTER MEDICITY POS DEBIT,700,,438245.77
1,1/1/2019,POS 541919XXXXXX4335 WESTSIDE POS DEBIT,7291,,430954.77
2,1/1/2019,POS 541919XXXXXX4335 EASY DAY POS DEBIT,208,,430746.77
3,2/1/2019,20190102032039502112/PAYTMWALLETLOADING,2000,,428746.77
4,2/1/2019,50100034192891-TPT-RENT,11838,,416908.77
...,...,...,...,...,...
95,15/02/19,MONTHLY INTEREST CREDIT 50300306138000,,245,359334.02
96,15/02/19,POS 541919XXXXXX4335 ITUNES.COM/BILI POS DEBIT,3099,,356235.02
97,15/02/19,20190215105839821857/PAYTMOYOROOMSCOM,4824,,351411.02
98,16/02/19,POS 541919XXXXXX4335 M/S SUGAR RUSH V PO S DEBIT,140,,349341.02
99,17/02/19,IMPS-904811141976-V ARUN KUMAR REDDY-ICI C-XXX...,55000,,294341.02

In [8]:
category = pd.read_csv('Category.csv')

category.head()

        Category Keywords
0  Miscellaneous     rety
1      Transport     AUTO
2  Entertainment    TUNES
3  Entertainment   ITUNES
4  Entertainment  netflix

In [9]:
len(category)

38

In [10]:
df.columns = [x.strip().lower() for x in df.columns]
category.columns = [x.strip().lower() for x in category.columns]

In [11]:
# CHANGING TO LOWER CASE
df['particulars'] = df['particulars'].str.lower()
category['keywords'] = category['keywords'].str.lower()

In [12]:
def only_alnum(df, col):
    df[col] = df[col].replace(r'[^A-Za-z0-9]+', ' ', regex=True)

only_alnum(df, 'particulars')

In [13]:
df.head()

,transaction date,particulars,withdrawal amt,deposit amt,balance amt
0,1/1/2019,pos 541919xxxxxx4335 aster medicity pos debit,700,,438245.77
1,1/1/2019,pos 541919xxxxxx4335 westside pos debit,7291,,430954.77
2,1/1/2019,pos 541919xxxxxx4335 easy day pos debit,208,,430746.77
3,2/1/2019,20190102032039502112 paytmwalletloading,2000,,428746.77
4,2/1/2019,50100034192891 tpt rent,11838,,416908.77

In [14]:
category['keywords'][0]

'rety'

In [15]:
df['particulars'][0]

'pos 541919xxxxxx4335 aster medicity pos debit '

In [16]:
keyword_found_main = []
for i in range(len(df)):
    keyword_found_sub = []
    for j in range(len(category)):
        if category['keywords'][j] in df['particulars'][i].split():
            keyword_found_sub.append(category['category'][j])
        else:
            keyword_found_sub.append('not found')
    keyword_found_sub = list(set(keyword_found_sub)) #to remove duplicates 
    keyword_found_sub = [keyword_found_sub[k] for k in range(len(keyword_found_sub)) if keyword_found_sub[k] != 'not found'] #if the keyword is not equal to found, pick it 
    keyword_found_main.append(keyword_found_sub[0] if keyword_found_sub else 'not found')#if more than one category is found, then pick the first one
df['category'] = keyword_found_main

In [17]:
df.head()

,transaction date,particulars,withdrawal amt,deposit amt,balance amt,category
0,1/1/2019,pos 541919xxxxxx4335 aster medicity pos debit,700,,438245.77,Health
1,1/1/2019,pos 541919xxxxxx4335 westside pos debit,7291,,430954.77,Shopping
2,1/1/2019,pos 541919xxxxxx4335 easy day pos debit,208,,430746.77,Shopping
3,2/1/2019,20190102032039502112 paytmwalletloading,2000,,428746.77,not found
4,2/1/2019,50100034192891 tpt rent,11838,,416908.77,Housing

In [18]:
import os  
os.makedirs('folder/subfolder', exist_ok=True)  
df.to_csv('/Users/onyekachukwuojumah/Desktop/projects/DATA.csv')